from tkinter import Tk # Імпортуємо клас Tk з бібліотеки tkinter для створення головного вікна програми.
from src.org.example.control.Control import Control # Імпортуємо клас Control з модуля Control.py.

class App:
    """
    Клас App відповідає за створення та запуск головного вікна програми.
    Він ініціалізує об'єкт Control та передає йому кореневий об'єкт Tkinter.
    """
    def __init__(self, root):
        """
        Ініціалізує об'єкт App.

        Args:
            root (tkinter.Tk): Кореневий об'єкт Tkinter.
        """
        self.control = Control() # Створює об'єкт класу Control, який управляє логікою програми.
        self.control.init_gui(root) # Викликає метод init_gui() об'єкта Control для ініціалізації графічного інтерфейсу, передаючи кореневий об'єкт Tk.

if __name__ == "__main__":
    """
    Цей блок коду виконується тільки при запуску скрипта безпосередньо, а не при імпортуванні його як модуля.
    Він створює головне вікно програми та запускає основний цикл обробки подій Tkinter.
    """
    root = Tk() # Створює кореневий об'єкт Tkinter, який є головним вікном програми.
    app = App(root) # Створює об'єкт класу App, передаючи йому кореневий об'єкт Tk.
    root.mainloop() # Запускає нескінченний цикл обробки подій Tkinter, який відповідає за реагування на дії користувача та оновлення інтерфейсу.
